Revit 2027 API
RadialArray.IsRotationAngleValid Method
 This indicates whether the input angle is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsRotationAngleValid(
	double angle
)
Public Shared Function IsRotationAngleValid (
	angle As Double
) As Boolean
public:
static bool IsRotationAngleValid(
	double angle
)
static member IsRotationAngleValid :
        angle : float -> bool
Parameters
angle Double
 The angle.
Return Value
Boolean
 True if the value of angle is not zero, false otherwise.
See Also
Reference
RadialArray Class
Autodesk.Revit.DB Namespace